Gateway/ResponseFile/20240508101351501_request.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
    <soapenv:Header/>
    <soapenv:Body>
        <tem:ApplyTransactionRequest xmlns:tem="http://tempuri.org/" xmlns:at="http://cps.huawei.com/cpsinterface/goa/at" xmlns:goa="http://cps.huawei.com/cpsinterface/goa">
            <at:Header>
                <goa:CommandID>CheckInformation</goa:CommandID>
                <goa:Version>1.0</goa:Version>
                <goa:LoginID>NGOPay_AEP</goa:LoginID>
                <goa:Password>YKHgC2pn6WMQg17ZF4Ax7zAS/u3myRJCNZ4nHiIYE4aPK00+6GybcIq2pCC/DYc0ZrsOai68sgVEn+nHWw5aUw==</goa:Password>
                <goa:Timestamp>20240508150800</goa:Timestamp>
                <goa:ConversationID>BE880IK8RU</goa:ConversationID>
                <goa:HeaderExtension>
                    <goa:Parameter>
                        <goa:Key>name</goa:Key>
                        <goa:Value>cps</goa:Value>
                    </goa:Parameter>
                </goa:HeaderExtension>
            </at:Header>
            <at:Body>
                <at:Parameters>
                    <goa:Parameter>
                        <goa:Key>ParentID</goa:Key>
                        <goa:Value>01717116383</goa:Value>
                    </goa:Parameter>
                    <goa:Parameter>
                        <goa:Key>channelCode</goa:Key>
                        <goa:Value>10</goa:Value>
                    </goa:Parameter>
                    <goa:Parameter>
                        <goa:Key>EndMonth</goa:Key>
                        <goa:Value/>
                    </goa:Parameter>
                    <goa:Parameter>
                        <goa:Key>StartMonth</goa:Key>
                        <goa:Value/>
                    </goa:Parameter>
                    <goa:Parameter>
                        <goa:Key>ChkAmount</goa:Key>
                        <goa:Value/>
                    </goa:Parameter>
                    <goa:Parameter>
                        <goa:Key>AccountID</goa:Key>
                        <goa:Value>01833182267</goa:Value>
                    </goa:Parameter>
                    <goa:Parameter>
                        <goa:Key>InquiryType</goa:Key>
                        <goa:Value/>
                    </goa:Parameter>
                    <goa:Parameter>
                        <goa:Key>ContractNo</goa:Key>
                        <goa:Value/>
                    </goa:Parameter>
                    <goa:Parameter>
                        <goa:Key>SubID</goa:Key>
                        <goa:Value/>
                    </goa:Parameter>
                    <goa:Parameter>
                        <goa:Key>FullName</goa:Key>
                        <goa:Value/>
                    </goa:Parameter>
                    <goa:Parameter>
                        <goa:Key>ChannelCode</goa:Key>
                        <goa:Value/>
                    </goa:Parameter>
                    <goa:Parameter>
                        <goa:Key>InquiryMode</goa:Key>
                        <goa:Value>0</goa:Value>
                    </goa:Parameter>
                    <goa:Parameter>
                        <goa:Key>IDNumber</goa:Key>
                        <goa:Value/>
                    </goa:Parameter>
                    <goa:Parameter>
                        <goa:Key>InitiatorID</goa:Key>
                        <goa:Value/>
                    </goa:Parameter>
                    <goa:Parameter>
                        <goa:Key>PartnerID</goa:Key>
                        <goa:Value>01794048749</goa:Value>
                    </goa:Parameter>
                    <goa:Parameter>
                        <goa:Key>LastName</goa:Key>
                        <goa:Value/>
                    </goa:Parameter>
                    <goa:Parameter>
                        <goa:Key>FirstName</goa:Key>
                        <goa:Value/>
                    </goa:Parameter>
                </at:Parameters>
            </at:Body>
        </tem:ApplyTransactionRequest>
    </soapenv:Body>
</soapenv:Envelope>